7767517
99 102
Input                    input.1                  0 1 input
Padding                  Pad_13                   1 1 input 100 0=3 1=3 2=3 3=3 4=2
Convolution              Conv_14                  1 1 100 101 0=32 1=7 6=4704
GroupNorm                Add_23                   1 1 101 112 1=32 2=1.000000e-05
ReLU                     LeakyRelu_24             1 1 112 113 0=2.000000e-01
Padding                  Pad_38                   1 1 113 136 1=1 3=1 4=2
Convolution              Conv_39                  1 1 136 137 0=64 1=3 3=2 6=18432
GroupNorm                Add_48                   1 1 137 148 1=64 2=1.000000e-05
ReLU                     LeakyRelu_49             1 1 148 149 0=2.000000e-01
Padding                  Pad_63                   1 1 149 172 0=1 1=1 2=1 3=1 4=2
Convolution              Conv_64                  1 1 172 173 0=64 1=3 6=36864
GroupNorm                Add_73                   1 1 173 184 1=64 2=1.000000e-05
ReLU                     LeakyRelu_74             1 1 184 185 0=2.000000e-01
Padding                  Pad_88                   1 1 185 208 1=1 3=1 4=2
Convolution              Conv_89                  1 1 208 209 0=128 1=3 3=2 6=73728
GroupNorm                Add_98                   1 1 209 220 1=128 2=1.000000e-05
ReLU                     LeakyRelu_99             1 1 220 221 0=2.000000e-01
Padding                  Pad_113                  1 1 221 244 0=1 1=1 2=1 3=1 4=2
Convolution              Conv_114                 1 1 244 245 0=128 1=3 6=147456
GroupNorm                Add_123                  1 1 245 256 1=128 2=1.000000e-05
ReLU                     LeakyRelu_124            1 1 256 257 0=2.000000e-01
Padding                  Pad_138                  1 1 257 280 0=1 1=1 2=1 3=1 4=2
Convolution              Conv_139                 1 1 280 281 0=128 1=3 6=147456
GroupNorm                Add_148                  1 1 281 292 1=128 2=1.000000e-05
ReLU                     LeakyRelu_149            1 1 292 293 0=2.000000e-01
Padding                  Pad_163                  1 1 293 316 4=2
Convolution              Conv_164                 1 1 316 317 0=256 1=1 6=32768
GroupNorm                Add_173                  1 1 317 328 1=256 2=1.000000e-05
ReLU                     LeakyRelu_174            1 1 328 329 0=2.000000e-01
Padding                  Pad_188                  1 1 329 352 0=1 1=1 2=1 3=1 4=2
ConvolutionDepthWise     Conv_189                 1 1 352 353 0=256 1=3 5=1 6=2304 7=256
GroupNorm                Add_198                  1 1 353 364 1=256 2=1.000000e-05
ReLU                     LeakyRelu_199            1 1 364 365 0=2.000000e-01
Convolution              Conv_200                 1 1 365 366 0=256 1=1 6=65536
GroupNorm                Add_209                  1 1 366 377 1=256 2=1.000000e-05
Split                    splitncnn_0              1 2 377 377_splitncnn_0 377_splitncnn_1
Padding                  Pad_223                  1 1 377_splitncnn_1 400 4=2
Convolution              Conv_224                 1 1 400 401 0=512 1=1 6=131072
GroupNorm                Add_233                  1 1 401 412 1=512 2=1.000000e-05
ReLU                     LeakyRelu_234            1 1 412 413 0=2.000000e-01
Padding                  Pad_248                  1 1 413 436 0=1 1=1 2=1 3=1 4=2
ConvolutionDepthWise     Conv_249                 1 1 436 437 0=512 1=3 5=1 6=4608 7=512
GroupNorm                Add_258                  1 1 437 448 1=512 2=1.000000e-05
ReLU                     LeakyRelu_259            1 1 448 449 0=2.000000e-01
Convolution              Conv_260                 1 1 449 450 0=256 1=1 6=131072
GroupNorm                Add_269                  1 1 450 461 1=256 2=1.000000e-05
BinaryOp                 Add_270                  2 1 377_splitncnn_0 461 462
Split                    splitncnn_1              1 2 462 462_splitncnn_0 462_splitncnn_1
Padding                  Pad_284                  1 1 462_splitncnn_1 485 4=2
Convolution              Conv_285                 1 1 485 486 0=512 1=1 6=131072
GroupNorm                Add_294                  1 1 486 497 1=512 2=1.000000e-05
ReLU                     LeakyRelu_295            1 1 497 498 0=2.000000e-01
Padding                  Pad_309                  1 1 498 521 0=1 1=1 2=1 3=1 4=2
ConvolutionDepthWise     Conv_310                 1 1 521 522 0=512 1=3 5=1 6=4608 7=512
GroupNorm                Add_319                  1 1 522 533 1=512 2=1.000000e-05
ReLU                     LeakyRelu_320            1 1 533 534 0=2.000000e-01
Convolution              Conv_321                 1 1 534 535 0=256 1=1 6=131072
GroupNorm                Add_330                  1 1 535 546 1=256 2=1.000000e-05
BinaryOp                 Add_331                  2 1 462_splitncnn_0 546 547
Split                    splitncnn_2              1 2 547 547_splitncnn_0 547_splitncnn_1
Padding                  Pad_345                  1 1 547_splitncnn_1 570 4=2
Convolution              Conv_346                 1 1 570 571 0=512 1=1 6=131072
GroupNorm                Add_355                  1 1 571 582 1=512 2=1.000000e-05
ReLU                     LeakyRelu_356            1 1 582 583 0=2.000000e-01
Padding                  Pad_370                  1 1 583 606 0=1 1=1 2=1 3=1 4=2
ConvolutionDepthWise     Conv_371                 1 1 606 607 0=512 1=3 5=1 6=4608 7=512
GroupNorm                Add_380                  1 1 607 618 1=512 2=1.000000e-05
ReLU                     LeakyRelu_381            1 1 618 619 0=2.000000e-01
Convolution              Conv_382                 1 1 619 620 0=256 1=1 6=131072
GroupNorm                Add_391                  1 1 620 631 1=256 2=1.000000e-05
BinaryOp                 Add_392                  2 1 547_splitncnn_0 631 632
Padding                  Pad_406                  1 1 632 655 0=1 1=1 2=1 3=1 4=2
Convolution              Conv_407                 1 1 655 656 0=128 1=3 6=294912
GroupNorm                Add_416                  1 1 656 667 1=128 2=1.000000e-05
ReLU                     LeakyRelu_417            1 1 667 668 0=2.000000e-01
Interp                   Resize_419               1 1 668 673 0=2 1=2.000000e+00 2=2.000000e+00
Padding                  Pad_433                  1 1 673 696 0=1 1=1 2=1 3=1 4=2
Convolution              Conv_434                 1 1 696 697 0=128 1=3 6=147456
GroupNorm                Add_443                  1 1 697 708 1=128 2=1.000000e-05
ReLU                     LeakyRelu_444            1 1 708 709 0=2.000000e-01
Padding                  Pad_458                  1 1 709 732 0=1 1=1 2=1 3=1 4=2
Convolution              Conv_459                 1 1 732 733 0=128 1=3 6=147456
GroupNorm                Add_468                  1 1 733 744 1=128 2=1.000000e-05
ReLU                     LeakyRelu_469            1 1 744 745 0=2.000000e-01
Interp                   Resize_471               1 1 745 750 0=2 1=2.000000e+00 2=2.000000e+00
Padding                  Pad_485                  1 1 750 773 0=1 1=1 2=1 3=1 4=2
Convolution              Conv_486                 1 1 773 774 0=64 1=3 6=73728
GroupNorm                Add_495                  1 1 774 785 1=64 2=1.000000e-05
ReLU                     LeakyRelu_496            1 1 785 786 0=2.000000e-01
Padding                  Pad_510                  1 1 786 809 0=1 1=1 2=1 3=1 4=2
Convolution              Conv_511                 1 1 809 810 0=64 1=3 6=36864
GroupNorm                Add_520                  1 1 810 821 1=64 2=1.000000e-05
ReLU                     LeakyRelu_521            1 1 821 822 0=2.000000e-01
Padding                  Pad_535                  1 1 822 845 0=3 1=3 2=3 3=3 4=2
Convolution              Conv_536                 1 1 845 846 0=32 1=7 6=100352
GroupNorm                Add_545                  1 1 846 857 1=32 2=1.000000e-05
ReLU                     LeakyRelu_546            1 1 857 858 0=2.000000e-01
Convolution              Conv_547                 1 1 858 859 0=3 1=1 6=96
UnaryOp                  Tanh_548                 1 1 859 out 0=16
